{
    "title": {
     "default": "DORA Self-Assessment 0.01",
     "fr": "Auto-Évaluation de DORA 0.01"
    },
    "pages": [
     {
      "name": "welcome",
      "elements": [
       {
        "type": "html",
        "name": "welcome1",
        "html": {
         "default": "This is a work in progress and changes may be made regularly. You can follow its development and even participate by joining us on the GitHub <a href='https://github.com/sara-sabr/dora-js/' target='_blank'>project repository</a>.</br></br>If you find a bug or if you encounter a problem, please create an <a href='https://github.com/sara-sabr/dora-js/issues' target='_blank'>issue on the project site.</a><h3>Can I use this project for my government or company?</h3>Yes, this is an open source project released under the MIT licence and you are welcome to use it for your own needs. See the link above for the project repository.</br></br>Please provide notice of licence and attribution of the work where required.<h3>What is the DORA Self-Assessment?</h3>It is a questionnaire designed to help you assess your alignement with DevOps practices as per the DevOps Research and Assessment (DORA) set of metrics and suggest possible ways to improve your DevOps practice.<h3>How does it work?</h3>The questionnaire asks you questions related to your business process, tools and organizational environment. The results will demonstrate your alignement level as well as propose ways to improve certain areas of your work.<h3>Where can I find out about my results?</h3>When you complete the questionnaire, a detailed results page will be displayed. You can print it or save it as PDF.<h3>Can I save my responses and complete the questionnaire later?</h3>Yes. When you want to save your progress, click on the 'Save' button at the top of the window and save the JSON file (machine readable structure text document) to your local folders. If you want to continue where you left off, click on the 'Choose file' button and select your saved JSON file.<h3>Do you store my answers?</h3>No. We don't store your responses and data only remains within your browser's local storage. Feel free to use this tool as many times as you want to. </br></br>All data will be deleted if you click on the button 'Start over'",
         "fr": "Il s'agit d'un travail en cours et des changements peuvent être apportés régulièrement. Vous pouvez suivre son évolution et même y participer en nous rejoignant sur le GitHub <a href='https: //github.com/sara-sabr/dora-js/' target='_blank'>dépôt du projet</a>.</br></br>Si vous trouvez un bug ou si vous rencontrez un problème, veuillez créer un <a href='https://github.com/sara-sabr/dora-js/issues' target='_blank'>publié sur le site du projet.</a><<h3>Puis-je utiliser ce projet pour mon gouvernement ou mon entreprise ? </h3>Oui, il s'agit d'un projet à source ouverte publié sous la licence du MIT et vous pouvez l'utiliser pour vos propres besoins. Voir le lien ci-dessus pour le dépôt du projet.</br></br>Veuillez fournir un avis de licence et l'attribution du travail si nécessaire.<h3>Qu'est-ce que l'auto-évaluation DORA ? </h3> C'est un questionnaire conçu pour vous aider à évaluer votre alignement avec les pratiques DevOps selon l'ensemble des mesures de DevOps Research and Assessment (DORA) et à suggérer des moyens possibles d'améliorer votre pratique DevOps.<h3>Comment ça marche ? Les résultats démontreront votre niveau d'alignement et proposeront des moyens d'améliorer certains domaines de votre travail.<h3>Où puis-je trouver mes résultats?</h3>Quand vous aurez rempli le questionnaire, une page de résultats détaillés sera affichée. Vous pouvez l'imprimer ou l'enregistrer au format PDF.<h3>Puis-je enregistrer mes réponses et remplir le questionnaire plus tard ? Lorsque vous souhaitez enregistrer votre progression, cliquez sur le bouton 'Enregistrer' en haut de la fenêtre et sauvegardez le fichier JSON (document texte à structure lisible par machine) dans vos dossiers locaux. Si vous voulez continuer là où vous vous êtes arrêté, cliquez sur le bouton 'Choisir le fichier' et sélectionnez votre fichier JSON sauvegardé. <h3>Mémorisez-vous mes réponses ? </h3>Non. Nous ne mémorisons pas vos réponses et les données restent uniquement dans la mémoire locale de votre navigateur. N'hésitez pas à utiliser cet outil autant de fois que vous le souhaitez. </br></br>Toutes les données seront effacées si vous cliquez sur le bouton 'Recommencer'."
        }
       }
      ]
     },
     {
      "name": "sections",
      "elements": [
       {
        "type": "boolean",
        "name": "section_one_enable",
        "title": "Section 1: Version Control and Code Maintainability",
        "description": "Learn how to implement better version control practices for reproducibility and traceability. Make it easy for developers to find, reuse, and change code, and keep dependencies up-to-date.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_two_enable",
        "title": "Section 2: Continuous Integration and Deployment",
        "description": "Learn about common mistakes, ways to measure, and how to improve on your continuous integration efforts. Best practices and approaches for deployment automation and reducing manual intervention in the release process.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_three_enable",
        "title": "Section 3: Continuous Testing",
        "description": "Improve software quality by building reliable automated test suits and performing all kinds of testing throughout the software delivery lifecycle. Make deploying software a reliable, low-risk process that can be performed on demand at any time.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_four_enable",
        "title": "Section 4: Architecture",
        "description": "Learn about moving from a tightly coupled architecture to service-oriented and micro service architectures without re-architecting everything at once. Empower teams to make informed decisions on tools and technologies. Learn how these decisions drive more effective software delivery.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_five_enable",
        "title": "Section 5: Cloud Infrastructure",
        "description": "Find out how to manage cloud infrastructure effectively so you can achieve higher levels of agility, availability, and cost visibility.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_six_enable",
        "title": "Section 6: Team Experimentation and Streamlining Change Approval",
        "description": "Innovate faster by building empowered teams that can try out new ideas without approval from people outside the team. Replace heavyweight change-approval process with peer review, to get the benefits of a more reliable, compliant release process without sacrificing speed.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_seven_enable",
        "title": "Section 7: Customer Feedback and Work Visibility",
        "description": "Drive better organizational outcomes by gathering customer feedback and incorporating it into product and feature design. Understand and visualize the flow of work from idea to customer outcome in order to drive higher performance.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_eight_enable",
        "title": "Section 8: Data Application Monitoring",
        "description": "Improve monitoring across infrastructure platforms and the application tier, so you can provide fast feedback to developers. Learn how to build tooling to help you to understand and debug your production system.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_nine_enable",
        "title": "Section 9: Work in Process Limits and Visual Management",
        "description": "Prioritize work, limit the amount of things that people are working on, and focus on getting a small number of high-priority tasks done. Learn about the principles of visual management to promote information sharing, get a common understanding of where the team is, and how to improve.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_ten_enable",
        "title": "Section 10: Learning and Generative Culture",
        "description": "Discover how growing a generative, high-trust culture drives better organizational and software delivery performance. Grow a learning culture and understand its impact on your organization performance.",
        "defaultValue": "true"
       },
       {
        "type": "boolean",
        "name": "section_eleven_enable",
        "title": "Section 11: Transformation and Transformational Leadership",
        "description": "Learn how effective leaders influence software delivery performance by driving the adoption of technical and product management capabilities.",
        "defaultValue": "true"
       }
      ],
      "title": {
       "fr": "Sections",
       "default": "Sections"
      },
      "description": "Please select the sections from which you would like to be evaluated against. By default all of them are enabled. "
     },
     {
      "name": "sectionOne",
      "elements": [
       {
        "type": "rating",
        "name": "question1",
        "title": "We can recover application code from the version control system.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question2",
        "title": "We can reconfigure systems from files in the version control system.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question3",
        "title": "It is easy to change code maintained by other teams if we need to.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question4",
        "title": "It is easy to find examples in our codebase.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question5",
        "title": "It is easy to reuse other people’s code.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question6",
        "title": "It is easy to add new dependencies to a project.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question7",
        "title": "It is easy to migrate to a new version of a dependency.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question8",
        "title": "Dependencies are stable and rarely break teams’ code.",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_one_enable} = true",
      "title": "Section One - Version Control and Code Maintainability",
      "description": "Please rate how strongly you agree or disagree with the following statements. For the primary application or service my team works on:"
     },
     {
      "name": "sectionTwo",
      "elements": [
       {
        "type": "rating",
        "name": "question9",
        "title": "Code commits result in an automated build of the software.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question10",
        "title": "Code commits result in a series of automated tests being run.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question11",
        "title": "Automated builds and tests are executed successfully every day.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question12",
        "title": "Current builds are available to testers for exploratory testing.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question13",
        "title": "Developers get feedback from the acceptance and performance tests every day. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question14",
        "title": "Our software is in a deployable state throughout its lifecycle. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question15",
        "title": "My team prioritizes keeping the software deployable over working on new features. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question16",
        "title": "Fast feedback on the quality and deployability of the system is available to anyone on the team. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question17",
        "title": "When people get feedback that the system is not deployable (such as failing builds or tests), they make fixing these issues their highest priority.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question18",
        "title": "We can deploy our system to production, or to end users, at any time, on demand. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question19",
        "title": "Features undergo security review early in the design process. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question20",
        "title": "Security reviews do not slow down the development cycle. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question21",
        "title": "Security requirements are included in the automated testing process.",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_two_enable} = true",
      "title": "Section Two - Continuous Integration and Deployment",
      "description": "Please rate how strongly you agree or disagree with the following statements. For the primary application or service my team works on:"
     },
     {
      "name": "sectionThree",
      "elements": [
       {
        "type": "rating",
        "name": "question22",
        "title": "Developers primarily create and maintain acceptance tests.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question23",
        "title": "When the automated tests pass, we are confident the software is releasable.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question24",
        "title": "Test failures are likely to indicate a real defect. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question25",
        "title": "It is easy for developers to fix acceptance test failures.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question26",
        "title": "Developers use their own development environment to reproduce acceptance failures.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question27",
        "title": "Automated tests are seamlessly integrated into our software delivery tech bricks.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question28",
        "title": "We continuously review and improve our test suite to better find defects and keep complexity and cost under control.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question29",
        "title": "Testers work alongside developers throughout the software development and delivery process.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question30",
        "title": "Manual test activities such as exploratory testing, usability testing, and acceptance testing are performed continuously throughout the delivery process.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question31",
        "title": "Developers practice test-driven development by writing unit tests before writing production code for all changes to the codebase.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question32",
        "title": "Adequate test data is available to run full automated test suites. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question33",
        "title": "Test data can be acquired on demand.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question34",
        "title": "Test data does not limit or constrain the automated tests that we can run. ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_three_enable} = true",
      "title": "Section Three - Continuous Testing",
      "description": "Please rate how strongly you agree or disagree with the following statements. For the primary application or service my team works on:"
     },
     {
      "name": "SectionFour",
      "elements": [
       {
        "type": "rating",
        "name": "question35",
        "title": "We can make large-scale changes to the design of our system without the permission of somebody outside the team or creating significant work for other teams. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question36",
        "title": "To complete our work, we do not need to communicate and coordinate with people outside the team. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question37",
        "title": "We can deploy and release our product or service on demand, independently of other services it depends upon. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question38",
        "title": "We can do most of our testing on demand, without requiring an integrated test environment.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question39",
        "title": "We perform deployments during normal business hours with negligible downtime.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question40",
        "title": "My team feels that we are empowered to choose tools.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question41",
        "title": "My team proactively investigates new tools for new projects.",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_four_enable} = true",
      "title": "Section Four - Architecture",
      "description": "Please rate how strongly you agree or disagree with the following statements. For the primary application or service my team works on:"
     },
     {
      "name": "sectionFive",
      "elements": [
       {
        "type": "rating",
        "name": "question42",
        "title": "Once we have access, we can independently provision and configure the cloud resources and capabilities required for our product or service on demand without raising tickets or requiring human interaction.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question43",
        "title": "The service or product that we primarily work on is designed to be accessed from a broad range of devices (e.g. smartphones, tablets, laptops) over the network without the need for proprietary plug-ins or protocols.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question44",
        "title": "The cloud our product or service runs on serves multiple teams and applications, with compute and infrastructure resources dynamically assigned and re-assigned based on demand.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question45",
        "title": "We can dynamically increase or decrease the cloud resources available for the service or product that we primarily support based on demand.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question46",
        "title": "We can monitor or control the quantity and/or cost of cloud resources used by the service or product that we primarily support.",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_five_enable} = true",
      "title": "Section Five - Cloud Infrastructure",
      "description": "Please rate how strongly you agree or disagree with the following statements. On my team:"
     },
     {
      "name": "sectionSix",
      "elements": [
       {
        "type": "rating",
        "name": "question47",
        "title": "We are able to work on new ideas and experiment. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question48",
        "title": "We are able to do work and make changes without having to ask for permission. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question49",
        "title": "We are able to make changes to user needs and specifications during a project.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question50",
        "title": "Changes can be promoted to production without manual change approvals. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question51",
        "title": "We have a clear understanding of the process to get changes approved for implementation. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question52",
        "title": "We are confident they can get changes through the approval process in a timely manner and knows the steps it takes to go from “submitted” to “accepted”. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question53",
        "title": "Tools and platforms are agreed upon and tailored to the needs of the project. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question54",
        "title": "We promote team development and handle cross-functional activities..",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question55",
        "title": "We execute peer review which includes reviews, comments, and approvals captured as part of the development process. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question56",
        "title": "We consider the development platform as a product by evaluating the changes on multiple axes, including security, performance, and stability, as well as defects. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question57",
        "title": "We continuously improve business processes by identifying and eliminating bottlenecks. ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_six_enable} = true",
      "title": "Section 6. Team Experimentation and Streamlining Change Approval",
      "description": "Please rate how strongly you agree or disagree with the following statements. On my team:"
     },
     {
      "name": "sectionSeven",
      "elements": [
       {
        "type": "rating",
        "name": "question58",
        "title": "We actively collect customer feedback on product and features quality.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question59",
        "title": "We establishe key metrics on customer satisfaction before gathering information from the customers.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question60",
        "title": "After seeking customer feedbacks, the team utilizes the response to understand the pain points and find solutions quickly.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question61",
        "title": "We are able to use value streams to gain insight and guide necessary improvements to ensure we have the bandwidth to support functionality and the documentation to put it into place.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question62",
        "title": "We focus on building, testing, and releasing code changes to an (production or testing) environment in small batches. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question63",
        "title": "Following production release, we are able to amplify feedback from users quickly using techniques (ex: AB testing) and enable short lead times faster. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question64",
        "title": "Feedback received is simple, easy to understand and provides actionable information. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question65",
        "title": "Our features are sliced in a way that lend themselves to frequent production releases. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question66",
        "title": "Our features are decomposed in a way that allows a developer to complete the work in a week or less. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question67",
        "title": "Our work is decomposed into features that allow for minimum viable products (MVP) and rapid development, rather than complex and lengthy processes (an MVP has just enough features to get validated learning about the product & its continued development). ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_seven_enable} = true",
      "title": "Section 7: Customer Feedback and Work Visibility",
      "description": "Please rate how strongly you agree or disagree with the following statements. On my team:"
     },
     {
      "name": "sectionEight",
      "elements": [
       {
        "type": "rating",
        "name": "question68",
        "title": "We have a solution in place to report on the overall health of systems (e.g, are my systems functioning? / do my systems have sufficient resources available?).",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question69",
        "title": "We have a solution in place to report on system state as experienced by customers (e.g., “do my customers know if my system is down and have a bad experience?”). ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question70",
        "title": "We have a solution in place for monitoring key business and systems metrics.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question71",
        "title": "We have tooling in place that can help us with understanding and debugging our systems in production.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question72",
        "title": "We have tooling in place that provides the ability to find information about things we did not previously know (e.g., we can identify “unknown unknowns”). ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question73",
        "title": "We have access to tools and data which help us trace, understand, and diagnose infrastructure problems in our production environment, including interactions between services. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question74",
        "title": "Data from infrastructure and application performance monitoring tools is used to make business decisions. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question75",
        "title": "Monitoring gives rapid feedback which helps quickly find and fix problems early in the project lifecycle. ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_eight_enable} = true",
      "title": "Section 8: Data Application Monitoring",
      "description": "How do you watch and understand your systems at work? Please rate how strongly you agree or disagree with the following statements. On my team:"
     },
     {
      "name": "sectionNine",
      "elements": [
       {
        "type": "rating",
        "name": "question76",
        "title": "We are good at limiting our work in process (WIP). ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question77",
        "title": "We strive to limit our WIP, and have processes in place to do so. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question78",
        "title": "Our WIP limits lead to process improvement. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question79",
        "title": "We are not often assigned to work on multiple mutually exclusive tasks. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question80",
        "title": "When faced with too much work and too few people to do it, we prioritize work and focus on completing a small number of high-priority tasks. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question81",
        "title": "Our work is visible to other teams and stakeholders. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question82",
        "title": "We use up to date visual displays and dashboards to manage the work at various stages of a process. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question83",
        "title": "When looking at visual management displays we see the key process metrics the team cares about. ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_nine_enable} = true",
      "title": "Section Nine - Work In Process Limits and Visual Management",
      "description": "Please rate how strongly you agree or disagree with the following statements. On my team:"
     },
     {
      "name": "sectionTen",
      "elements": [
       {
        "type": "rating",
        "name": "question84",
        "title": "Learning is the key to improvement. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question85",
        "title": "Once we quit learning we endanger our future. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question86",
        "title": "Learning is viewed as an investment, not an expense.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question87",
        "title": "Their is a regular cadence of opportunities for employees to share their knowledge. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question88",
        "title": "Information is actively sought.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question89",
        "title": "Messengers are not punished when they deliver news of failures or other bad news.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question90",
        "title": "Responsibilities are shared. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question91",
        "title": "Cross-functional collaboration is encouraged and rewarded.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question92",
        "title": "Failures are treated primarily as opportunities to improve the system. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question93",
        "title": "Employees feel supported by each other and that their feedback is valued.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question94",
        "title": "Employees are given meaningful work that leverages their expertise. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question95",
        "title": "My team’s culture interacts with the broader organizational culture. ",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_ten_enable} = true",
      "title": "Section Ten - Learning and Generative Culture",
      "description": "Please rate how strongly you agree or disagree with the following statements as descriptive of your team and the organization:"
     },
     {
      "name": "sectionEleven",
      "elements": [
       {
        "type": "rating",
        "name": "question96",
        "title": "My team understands clearly the current/target conditions, up to 5 (five) years in the future, and produces outcomes that match up with the purpose of the organization.",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question97",
        "title": "My team is running experiments on a daily basis to try to move toward the target conditions or key results. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question98",
        "title": "Leaders understand clearly where my team and the organization are going, and where they want the team to be in five years. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question99",
        "title": "Leaders say positive things about my team and make employees proud to be a part of their organization. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question100",
        "title": "Leaders challenge team members to think about old problems in new ways and to rethink some of their basic assumptions about their work. ",
        "isRequired": true,
        "rateMax": 7
       },
       {
        "type": "rating",
        "name": "question101",
        "title": "Leaders behave in a manner which is thoughtful of my team member interests and personal needs.",
        "isRequired": true,
        "rateMax": 7
       }
      ],
      "visibleIf": "{section_eleven_enable} = true",
      "title": "Section Eleven - Transformation and Transformational Leadership",
      "description": "Please rate how strongly you agree or disagree with the following statements as descriptive of your team and the organization:"
     }
    ],
    "showQuestionNumbers": "off",
    "showProgressBar": "top",
    "firstPageIsStarted": true
   }